Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/CommonModules/дт_ОбщегоНазначенияВызовСервера/Module.bsl
Процедура ПереченьНоменклатурыJSON() Экспорт
	// КомлевАА +_++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.Код,
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		МассивТоваров  = Новый Массив;

		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("name", Выборка.Наименование);
			СтруктураОтвета.Вставить("code", Выборка.Код);
			СтруктураОтвета.Вставить("article", Выборка.Артикул);
			МассивТоваров.Добавить(СтруктураОтвета);
		КонецЦикла;
	КонецЕсли;
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\Комлев\Товары.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
	// КомлевАА ----
КонецПроцедуры

Процедура ВыгрузитьТоварыВJSON() Экспорт
	// КомлевАА +_++
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.Текст =
	"ВЫБРАТЬ 
	|	СпрИндКод.Владелец.Наименование КАК Наименование,
	|	СпрИндКод.Владелец.Артикул КАК Артикул,
	|	РегистрИндНомер.индкод КАК индкод,
	|	РегистрИндНомер.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ИндНомер КАК РегистрИндНомер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИндКод КАК СпрИндКод
	|		ПО РегистрИндНомер.индкод = СпрИндКод.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО РегистрНакопления1Остатки.индкод = РегистрИндНомер.индкод
	|ГДЕ
	|	РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И РегистрИндНомер.ЕстьФото = ИСТИНА";

	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДатаСеанса(), -1);
	ЗапросТоваров.УстановитьПараметр("ДатаМесяцНазад", ДатаМесяцНазад);
	Выборка = ЗапросТоваров.Выполнить().Выбрать();
	Выборка1 = ЗапросТоваров.Выполнить().Выбрать();

	МассивИндкод = Новый Массив;
	МассивТоваров = Новый массив;

	Пока Выборка1.Следующий() Цикл
		МассивИндкод.добавить (Строка(Выборка1.индкод));
	КонецЦикла;

	ФоткиИндкод = РаботаССайтомWT.ПолучениеФотоБезИндНомер(МассивИндкод);

	Пока Выборка.Следующий() Цикл

		Для Каждого Строка Из ФоткиИндкод Цикл

			Если Строка.indCode = Строка(Выборка.индкод) Тогда
				СтруктураТоваров = Новый Структура;

				Если Строка.urls.Количество() > 0 Тогда
					Структура = Новый Структура;
					Структура.Вставить("id", Строка.indCode);
					Фото = Строка.urls[0];
					СтруктураТоваров.Вставить("name", Строка(Выборка.Наименование));
					СтруктураТоваров.Вставить("article", Строка(Выборка.Артикул));
					СтруктураТоваров.Вставить("id", Строка(Выборка.индкод));
					СтруктураТоваров.Вставить("price", Число(Выборка.Цена));
					СтруктураТоваров.Вставить("photo", Фото);
					Прервать;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

		Если ЗначениеЗаполнено(СтруктураТоваров) Тогда
			МассивТоваров.Добавить(СтруктураТоваров);
		КонецЕсли;

	КонецЦикла;

	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\common\verified_products.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
		// КомлевАА ---
КонецПроцедуры

#Область ПрограммныйИнтерфейс
Функция Просклонять(Слово, Падеж) Экспорт

	Возврат дт_ОбщегоНазначенияПовтИсп.Просклонять(Слово, Падеж);

КонецФункции

Функция ПолучитьСуммуДокументов(Знач Коллекция) Экспорт

	Возврат дт_ОбщегоНазначения.ПолучитьСуммуДокументов(Коллекция);

КонецФункции // ПолучитьСуммуДокументов()

Функция ПолучитьСсылкуПоУИ(УИ, ИмяОбъекта) Экспорт

	Результат = Неопределено;
	
	Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Документы[ИмяОбъекта].ПолучитьСсылку(УИ);
	ИначеЕсли Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(УИ);
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // ПолучитьСсылкуПоУИ()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
